test/Cylinder_with_hole/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    down
    {
        type            patch;
        nFaces          40;
        startFace       3880;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       3920;
    }
    up
    {
        type            patch;
        nFaces          40;
        startFace       3960;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       4000;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4080;
        startFace       4040;
    }
)

// ************************************************************************* //
